docs/index.org
#+TITLE: clisuite Documentation
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="clisuite.css"/>

* Index
** GitHub repo / README: https://github.com/mitchellirmer/clisuite
* Metube
Use this to stream music or videos from the internet, especially Youtube.  Has a function to search Youtube via yt-dlp.  Built on mpv, yt-dlp, sed, grep.

** Source Code

*** Header stuff
I put these lines in my scripts so that I can grep the := to be reminded of what my scripts do.

#+begin_src sh :tangle "../src/metube.sh"
# YouTube Search
# := CLI for searching YouTube.
#+end_src

*** Set up an internal path variable
This will be used to integrate speckify with metube and handle temp files generated while using this script.

#+begin_src sh :tangle "../src/metube.sh"
path="$HOME/.clisuite/src/"
pl_loc="$HOME/Music/Stream/Playlists/"
#+end_src

*** Help menu
#+begin_src sh :tangle "../src/metube.sh"
printHelp(){
    echo "========METUBE HELP=========="
    echo "metube <option> <argument(s)>"
    echo "EXAMPLE:  metube search \"nebraska football\" 5"
    echo "1)  < -s or search>  <\"search terms\">               <number of desired search results>"
    echo "2)  < -d or desc>    <line number of video title>"
    echo "3)  < -p or play>    <line number of video title>"
    echo "4)  < -a or add>     <line number of video title>   <\"Playlist_Title\">"
    echo "5)  < -c or copy>    <YouTube playlist URL>         <\"Local Title\">"
    echo "6)  < -e or export>  <\"Playlist_Title\">"
    echo "=============================="
}
#+end_src

*** Main program

#+begin_src sh :tangle "../src/metube.sh"
if [ -z "$1" ]; then
    printHelp
elif [ $1 == "-s" ] || [ $1 == "search" ]; then
    rm ${path}ytreturn.txt
    yt-dlp --print title --print uploader --print webpage_url "ytsearch$3:$2" > ${path}ytreturn.txt
    cat -n ${path}ytreturn.txt
elif [ $1 == "-d" ] || [ $1 == "desc" ]; then
    declare line=$2
    line=$((${line} + 2))
    line="${line}p"
    track=$(sed -n $line ${path}ytreturn.txt)
    yt-dlp --print title --print uploader --print upload_date --print webpage_url --print description $track
elif [ $1 == "-p" ] || [ $1 == "play" ]; then
    declare line=$2
    line=$((${line} + 2))
    line="${line}p"
    track=$(sed -n $line ${path}ytreturn.txt)
    mpv $track
elif ( [ $1 == "-a" ] || [ $1 == "add" ] ) && [[ ! -z "$3" ]]; then
    declare line=$2
    address=$((${line} + 2))
    line="${line}p"
    address="${address}p"
    track=$(sed -n $line ${path}ytreturn.txt)
    url=$(sed -n $address ${path}ytreturn.txt)
    echo $track > ${path}tmptitle.txt
    echo $url > ${path}tmpurl.txt
    paste ${path}tmpurl.txt ${path}tmptitle.txt >> ${path}${3}.m3u
    rm ${path}tmptitle.txt ${path}tmpurl.txt
elif [ $1 == "-c" ] || [ $1 == "copy" ]; then
    id="$(echo $2 | cut -f2- -d=)"
    prefix='https://www.youtube.com/playlist?list='
    fullurl="${prefix}${id}"
    yt-dlp --print title --print webpage_url "$fullurl" > tempfile
    grep -e "http" tempfile > urls
    grep -v "http" tempfile > titles
    paste urls titles > "$3".m3u
    rm tempfile; rm urls; rm titles
elif [ $1 == "-e" ] || [ $1 == "export" ]; then
    cp -v -i ${path}${2}.m3u ${pl_loc}${2}.m3u
else
    printHelp
fi
#+end_src
** License
*** GPL
#+ATTR_HTML: :target _blank
A copy of the license is [[file:Licenses/LICENSE.md][here]].
