docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-10 Sun 23:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>clisuite Documentation</title>
<meta name="author" content="Mitchell" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="clisuite.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">clisuite Documentation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd793b31">1. Index</a>
<ul>
<li><a href="#org255fd0d">1.1. GitHub repo / README: https://github.com/mitchellirmer/clisuite</a></li>
</ul>
</li>
<li><a href="#orgcafc6f3">2. Metube</a>
<ul>
<li><a href="#orgc6d89e1">2.1. Source Code</a>
<ul>
<li><a href="#org32a36cf">2.1.1. Header stuff</a></li>
<li><a href="#org4f30061">2.1.2. Set up an internal path variable</a></li>
<li><a href="#org641982a">2.1.3. Help menu</a></li>
<li><a href="#org5356894">2.1.4. Main program</a></li>
</ul>
</li>
<li><a href="#org6b51908">2.2. License</a>
<ul>
<li><a href="#org95d534f">2.2.1. GPL</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge862f47">3. Speckify</a>
<ul>
<li><a href="#org6e1ac14">3.1. Source Code</a>
<ul>
<li><a href="#org9b985be">3.1.1. Header stuff</a></li>
<li><a href="#orgafa7520">3.1.2. Set up an internal path variable</a></li>
<li><a href="#orga5831c0">3.1.3. Help menu</a></li>
<li><a href="#org118bf02">3.1.4. Main program</a></li>
</ul>
</li>
<li><a href="#org6e83cff">3.2. License</a>
<ul>
<li><a href="#orgf121d35">3.2.1. GPL</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc8add73">4. Readmode</a>
<ul>
<li><a href="#org8e4ed57">4.1. Source code</a>
<ul>
<li><a href="#orgf13ab0f">4.1.1. Header stuff</a></li>
<li><a href="#orgb623f56">4.1.2. Internal path for temp files</a></li>
<li><a href="#org11ba222">4.1.3. Main program</a></li>
</ul>
</li>
<li><a href="#org3d49c61">4.2. License</a></li>
</ul>
</li>
<li><a href="#org512266c">5. Dependencies</a>
<ul>
<li>
<ul>
<li><a href="#org7d8caab">5.0.1. fzf</a></li>
<li><a href="#org619db47">5.0.2. MPV</a></li>
<li><a href="#orgb011d25">5.0.3. yt-dlp</a></li>
<li><a href="#orgaafe3d5">5.0.4. readability</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd8e174e">6. Generate config file</a></li>
<li><a href="#org05bfd4a">7. Generate README.md</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd793b31" class="outline-2">
<h2 id="orgd793b31"><span class="section-number-2">1.</span> Index</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org255fd0d" class="outline-3">
<h3 id="org255fd0d"><span class="section-number-3">1.1.</span> GitHub repo / README: <a href="https://github.com/mitchellirmer/clisuite">https://github.com/mitchellirmer/clisuite</a></h3>
</div>
</div>
<div id="outline-container-orgcafc6f3" class="outline-2">
<h2 id="orgcafc6f3"><span class="section-number-2">2.</span> Metube</h2>
<div class="outline-text-2" id="text-2">
<p>
Use this to stream music or videos from the internet, especially Youtube.  Has a function to search Youtube via yt-dlp.  Built on mpv, yt-dlp, sed, grep.
</p>
</div>

<div id="outline-container-orgc6d89e1" class="outline-3">
<h3 id="orgc6d89e1"><span class="section-number-3">2.1.</span> Source Code</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org32a36cf" class="outline-4">
<h4 id="org32a36cf"><span class="section-number-4">2.1.1.</span> Header stuff</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
I put these lines in my scripts so that I can grep the := to be reminded of what my scripts do.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6a737d;"># </span><span style="color: #6a737d;">YouTube Search</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">:= CLI for searching YouTube.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f30061" class="outline-4">
<h4 id="org4f30061"><span class="section-number-4">2.1.2.</span> Set up an internal path variable</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
This will be used to integrate speckify with metube and handle temp files generated while using this script.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #24292e;">path</span>=<span style="color: #032f62;">"$HOME/.clisuite/src/"</span>
<span style="color: #24292e;">pl_loc</span>=<span style="color: #032f62;">"$HOME/Music/Stream/Playlists/"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org641982a" class="outline-4">
<h4 id="org641982a"><span class="section-number-4">2.1.3.</span> Help menu</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6f42c1;">printHelp</span>(){
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"========METUBE HELP=========="</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"metube &lt;option&gt; &lt;argument(s)&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"EXAMPLE:  metube search \"nebraska football\" 5"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"1)  &lt; -s or search&gt;  &lt;\"search terms\"&gt;               &lt;number of desired search results&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"2)  &lt; -d or desc&gt;    &lt;line number of video title&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"3)  &lt; -p or play&gt;    &lt;line number of video title&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"4)  &lt; -a or add&gt;     &lt;line number of video title&gt;   &lt;\"Playlist_Title\"&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"5)  &lt; -c or copy&gt;    &lt;YouTube playlist URL&gt;         &lt;\"Local Title\"&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"6)  &lt; -e or export&gt;  &lt;\"Playlist_Title\"&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"=============================="</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5356894" class="outline-4">
<h4 id="org5356894"><span class="section-number-4">2.1.4.</span> Main program</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d73a49;">if</span> [ -z <span style="color: #032f62;">"$1"</span> ]; <span style="color: #d73a49;">then</span>
    printHelp
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"-s"</span> ] || [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"search"</span> ]; <span style="color: #d73a49;">then</span>
    rm ${<span style="color: #24292e;">path</span>}ytreturn.txt
    yt-dlp --print title --print uploader --print webpage_url <span style="color: #032f62;">"ytsearch$3:$2"</span> &gt; ${<span style="color: #24292e;">path</span>}ytreturn.txt
    cat -n ${<span style="color: #24292e;">path</span>}ytreturn.txt
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"-d"</span> ] || [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"desc"</span> ]; <span style="color: #d73a49;">then</span>
    <span style="color: #d73a49;">declare</span> <span style="color: #24292e;">line</span>=$<span style="color: #24292e;">2</span>
    <span style="color: #24292e;">line</span>=$(<span style="color: #032f62;">(${line} + 2</span>))
    <span style="color: #24292e;">line</span>=<span style="color: #032f62;">"${line}p"</span>
    <span style="color: #24292e;">track</span>=$(<span style="color: #032f62;">sed -n $line ${path}ytreturn.txt</span>)
    yt-dlp --print title --print uploader --print upload_date --print webpage_url --print description $<span style="color: #24292e;">track</span>
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"-p"</span> ] || [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"play"</span> ]; <span style="color: #d73a49;">then</span>
    <span style="color: #d73a49;">declare</span> <span style="color: #24292e;">line</span>=$<span style="color: #24292e;">2</span>
    <span style="color: #24292e;">line</span>=$(<span style="color: #032f62;">(${line} + 2</span>))
    <span style="color: #24292e;">line</span>=<span style="color: #032f62;">"${line}p"</span>
    <span style="color: #24292e;">track</span>=$(<span style="color: #032f62;">sed -n $line ${path}ytreturn.txt</span>)
    mpv $<span style="color: #24292e;">track</span>
<span style="color: #d73a49;">elif</span> ( [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"-a"</span> ] || [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"add"</span> ] ) &amp;&amp; [[ <span style="color: #d73a49;">!</span> -z <span style="color: #032f62;">"$3"</span> ]]; <span style="color: #d73a49;">then</span>
    <span style="color: #d73a49;">declare</span> <span style="color: #24292e;">line</span>=$<span style="color: #24292e;">2</span>
    <span style="color: #24292e;">address</span>=$(<span style="color: #032f62;">(${line} + 2</span>))
    <span style="color: #24292e;">line</span>=<span style="color: #032f62;">"${line}p"</span>
    <span style="color: #24292e;">address</span>=<span style="color: #032f62;">"${address}p"</span>
    <span style="color: #24292e;">track</span>=$(<span style="color: #032f62;">sed -n $line ${path}ytreturn.txt</span>)
    <span style="color: #24292e;">url</span>=$(<span style="color: #032f62;">sed -n $address ${path}ytreturn.txt</span>)
    <span style="color: #d73a49;">echo</span> $<span style="color: #24292e;">track</span> &gt; ${<span style="color: #24292e;">path</span>}tmptitle.txt
    <span style="color: #d73a49;">echo</span> $<span style="color: #24292e;">url</span> &gt; ${<span style="color: #24292e;">path</span>}tmpurl.txt
    paste ${<span style="color: #24292e;">path</span>}tmpurl.txt ${<span style="color: #24292e;">path</span>}tmptitle.txt &gt;&gt; ${<span style="color: #24292e;">path</span>}${<span style="color: #24292e;">3</span>}.m3u
    rm ${<span style="color: #24292e;">path</span>}tmptitle.txt ${<span style="color: #24292e;">path</span>}tmpurl.txt
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"-c"</span> ] || [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"copy"</span> ]; <span style="color: #d73a49;">then</span>
    <span style="color: #24292e;">id</span>=<span style="color: #032f62;">"$(</span><span style="color: #032f62;">echo $2 | cut -f2- -d=</span><span style="color: #032f62;">)"</span>
    <span style="color: #24292e;">prefix</span>=<span style="color: #032f62;">'https://www.youtube.com/playlist?list='</span>
    <span style="color: #24292e;">fullurl</span>=<span style="color: #032f62;">"${prefix}${id}"</span>
    yt-dlp --print title --print webpage_url <span style="color: #032f62;">"$fullurl"</span> &gt; tempfile
    grep -e <span style="color: #032f62;">"http"</span> tempfile &gt; urls
    grep -v <span style="color: #032f62;">"http"</span> tempfile &gt; titles
    paste urls titles &gt; <span style="color: #032f62;">"$3"</span>.m3u
    rm tempfile; rm urls; rm titles
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"-e"</span> ] || [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"export"</span> ]; <span style="color: #d73a49;">then</span>
    cp -v -i ${<span style="color: #24292e;">path</span>}${<span style="color: #24292e;">2</span>}.m3u ${<span style="color: #24292e;">pl_loc</span>}${<span style="color: #24292e;">2</span>}.m3u
<span style="color: #d73a49;">else</span>
    printHelp
<span style="color: #d73a49;">fi</span>
</pre>
</div>
</div>
</div>
</div>
