docs/index.org
* Speckify
Use this to stream music from the internet or from playlist files containing file locations or URLs.  Built on mpv, ytdlp, sed, grep.

** Source Code
*** Header stuff
I put these lines in my scripts so that I can grep the := to be reminded of what my scripts do.

#+begin_src sh :tangle "../src/speckify.sh"
  # Speckify Music
  # := Searches all playlists in the folder; returns output to screen and out.m3u playlist.
#+end_src

*** Set up an internal path variable
This will be used to integrate speckify with metube and handle temp files generated while using this script.

#+begin_src sh :tangle "../src/speckify.sh"
path="$HOME/.clisuite/src/"
pl_loc="$HOME/Music/Stream/Playlists/"
#+end_src

*** Help menu
#+begin_src sh :tangle "../src/speckify.sh"
printHelp(){
    echo "========SPECKIFY HELP=========="
    echo "speckify <option> <argument(s)>"
    echo "EXAMPLE:  speckify search \"heads carolina\""
    echo "1)  < -s or search > <\"search terms\">"
    echo "2)  < -c or choose > <line number of track title>"
    echo "3)  < play >         <\"PlaylistName\">"
    echo "4)  < shuffle >      <\"PlaylistName\">"
    echo "5)  < library >"
    echo "=============================="
}
#+end_src

*** Main program
#+begin_src sh :tangle "../src/speckify.sh"
if [ -z "$1" ]; then
    printHelp
elif [ $1 == "-s" ] || [ $1 == "search" ]; then
    cd $pl_loc
    rm msearch.m3u
    grep -i "$2" *.m3u | cut -f2- -d: > msearch.m3u
    cat -n msearch.m3u
elif [ $1 == "-c" ] || [ $1 == "choose" ]; then
    cd $pl_loc
    line=$2
    line="${line}p"
    track=$(sed -n $line msearch.m3u)
    mpv --no-video $track
elif [ $1 == "play" ]; then
    cd $pl_loc
    list="$2"
    mpv --no-video ${pl_loc}${list}.m3u
elif [ $1 == "shuffle" ]; then
    cd $pl_loc
    list="$2"
    mpv --no-video --shuffle ${pl_loc}${list}.m3u
elif [ $1 == "library" ]; then
    cd $pl_loc
    ls *.m3u | cut -f1 -d. | more
else
    printHelp
fi
#+end_src
** License
*** GPL
#+ATTR_HTML: :target _blank
A copy of the license is [[file:Licenses/LICENSE.md][here]].

* Readmode
** Source code
*** Header stuff
The same header stuff I use to make it greppable 
#+begin_src sh :tangle "../src/readmode.sh"
# Read Mode
# := Takes a URL as input and feeds it to Mozilla Readability.  Read in w3m.
#+end_src

*** Internal path for temp files
#+begin_src sh :tangle "../src/readmode.sh"
path="$HOME/.clisuite/src/"
#+end_src

*** Main program
Requires readability to be installed already.  I used JS node.
#+begin_src sh :tangle "../src/readmode.sh"
curl $1 | readability $1 > ${path}readmodetempfile.html
w3m ${path}readmodetempfile.html
#+end_src
** License
Mozilla readability has an Apache 2.0 license, found [[file:Licenses/APACHE.md][here]].
* Dependencies

*** MPV
#+ATTR_HTML: :target _blank
A lightweight, command-line video player available [[https://github.com/mpv-player/mpv][here]].
*** yt-dlp
#+ATTR_HTML: :target _blank
Command-line interface for interacting with YouTube and other video/audio hosted on https, available [[https://github.com/yt-dlp/yt-dlp][here]].
*** readability
#+ATTR_HTML: :target _blank
Mozilla readability for isolating body of HTML pages, installed from [[https://www.npmjs.com/package/readability-cli/v/2.4.0][here]].

* Generate config file
#+begin_src text :tangle "../src/config" 
alias metube='sh $HOME/.clisuite/src/metube.sh'  
alias readmode='sh $HOME/.clisuite/src/readmode.sh'  
alias speckify='sh $HOME/.clisuite/src/speckify.sh'  
#+end_src

