docs/index.html
<div id="outline-container-org6b51908" class="outline-3">
<h3 id="org6b51908"><span class="section-number-3">2.2.</span> License</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org95d534f" class="outline-4">
<h4 id="org95d534f"><span class="section-number-4">2.2.1.</span> GPL</h4>
<div class="outline-text-4" id="text-2-2-1">
<p target="_blank">
A copy of the license is <a href="Licenses/LICENSE.md" target="_blank">here</a>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orge862f47" class="outline-2">
<h2 id="orge862f47"><span class="section-number-2">3.</span> Speckify</h2>
<div class="outline-text-2" id="text-3">
<p>
Use this to stream music from the internet or from playlist files containing file locations or URLs.  Built on mpv, ytdlp, sed, grep.
</p>
</div>

<div id="outline-container-org6e1ac14" class="outline-3">
<h3 id="org6e1ac14"><span class="section-number-3">3.1.</span> Source Code</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org9b985be" class="outline-4">
<h4 id="org9b985be"><span class="section-number-4">3.1.1.</span> Header stuff</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
I put these lines in my scripts so that I can grep the := to be reminded of what my scripts do.
</p>

<div class="org-src-container">
<pre class="src src-sh">  <span style="color: #6a737d;"># </span><span style="color: #6a737d;">Speckify Music</span>
  <span style="color: #6a737d;"># </span><span style="color: #6a737d;">:= Searches all playlists in the folder; returns output to screen and out.m3u playlist.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafa7520" class="outline-4">
<h4 id="orgafa7520"><span class="section-number-4">3.1.2.</span> Set up an internal path variable</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
This will be used to integrate speckify with metube and handle temp files generated while using this script.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #24292e;">path</span>=<span style="color: #032f62;">"$HOME/.clisuite/src/"</span>
<span style="color: #24292e;">pl_loc</span>=<span style="color: #032f62;">"$HOME/Music/Stream/Playlists/"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga5831c0" class="outline-4">
<h4 id="orga5831c0"><span class="section-number-4">3.1.3.</span> Help menu</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6f42c1;">printHelp</span>(){
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"========SPECKIFY HELP=========="</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"speckify &lt;option&gt; &lt;argument(s)&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"EXAMPLE:  speckify search \"heads carolina\""</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"1)  &lt; -s or search &gt; &lt;\"search terms\"&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"2)  &lt; -c or choose &gt; &lt;line number of track title&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"3)  &lt; play &gt;         &lt;\"PlaylistName\"&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"4)  &lt; shuffle &gt;      &lt;\"PlaylistName\"&gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"5)  &lt; library &gt;"</span>
    <span style="color: #d73a49;">echo</span> <span style="color: #032f62;">"=============================="</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org118bf02" class="outline-4">
<h4 id="org118bf02"><span class="section-number-4">3.1.4.</span> Main program</h4>
<div class="outline-text-4" id="text-3-1-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d73a49;">if</span> [ -z <span style="color: #032f62;">"$1"</span> ]; <span style="color: #d73a49;">then</span>
    printHelp
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"-s"</span> ] || [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"search"</span> ]; <span style="color: #d73a49;">then</span>
    <span style="color: #d73a49;">cd</span> $<span style="color: #24292e;">pl_loc</span>
    rm msearch.m3u
    grep -i <span style="color: #032f62;">"$2"</span> *.m3u | cut -f2- -d: &gt; msearch.m3u
    cat -n msearch.m3u
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"-c"</span> ] || [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"choose"</span> ]; <span style="color: #d73a49;">then</span>
    <span style="color: #d73a49;">cd</span> $<span style="color: #24292e;">pl_loc</span>
    <span style="color: #24292e;">line</span>=$<span style="color: #24292e;">2</span>
    <span style="color: #24292e;">line</span>=<span style="color: #032f62;">"${line}p"</span>
    <span style="color: #24292e;">track</span>=$(<span style="color: #032f62;">sed -n $line msearch.m3u</span>)
    mpv --no-video $<span style="color: #24292e;">track</span>
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"play"</span> ]; <span style="color: #d73a49;">then</span>
    <span style="color: #d73a49;">cd</span> $<span style="color: #24292e;">pl_loc</span>
    <span style="color: #24292e;">list</span>=$(<span style="color: #032f62;">ls *.m3u | cut -f1 -d. | fzf</span>)
    mpv --no-video ${<span style="color: #24292e;">pl_loc</span>}${<span style="color: #24292e;">list</span>}.m3u
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"shuffle"</span> ]; <span style="color: #d73a49;">then</span>
    <span style="color: #d73a49;">cd</span> $<span style="color: #24292e;">pl_loc</span>
    <span style="color: #24292e;">list</span>=$(<span style="color: #032f62;">ls *.m3u | cut -f1 -d. | fzf</span>)
    mpv --no-video --shuffle ${<span style="color: #24292e;">pl_loc</span>}${<span style="color: #24292e;">list</span>}.m3u
<span style="color: #d73a49;">elif</span> [ $<span style="color: #24292e;">1</span> == <span style="color: #032f62;">"library"</span> ]; <span style="color: #d73a49;">then</span>
    <span style="color: #d73a49;">cd</span> $<span style="color: #24292e;">pl_loc</span>
    ls *.m3u | cut -f1 -d. | more
<span style="color: #d73a49;">else</span>
    printHelp
<span style="color: #d73a49;">fi</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6e83cff" class="outline-3">
<h3 id="org6e83cff"><span class="section-number-3">3.2.</span> License</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgf121d35" class="outline-4">
<h4 id="orgf121d35"><span class="section-number-4">3.2.1.</span> GPL</h4>
<div class="outline-text-4" id="text-3-2-1">
<p target="_blank">
A copy of the license is <a href="Licenses/LICENSE.md" target="_blank">here</a>.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc8add73" class="outline-2">
<h2 id="orgc8add73"><span class="section-number-2">4.</span> Readmode</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8e4ed57" class="outline-3">
<h3 id="org8e4ed57"><span class="section-number-3">4.1.</span> Source code</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgf13ab0f" class="outline-4">
<h4 id="orgf13ab0f"><span class="section-number-4">4.1.1.</span> Header stuff</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
The same header stuff I use to make it greppable 
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6a737d;"># </span><span style="color: #6a737d;">Read Mode</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">:= Takes a URL as input and feeds it to Mozilla Readability.  Read in w3m.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb623f56" class="outline-4">
<h4 id="orgb623f56"><span class="section-number-4">4.1.2.</span> Internal path for temp files</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #24292e;">path</span>=<span style="color: #032f62;">"$HOME/.clisuite/src/"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org11ba222" class="outline-4">
<h4 id="org11ba222"><span class="section-number-4">4.1.3.</span> Main program</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Requires readability to be installed already.  I used JS node.
</p>
<div class="org-src-container">
<pre class="src src-sh">curl $<span style="color: #24292e;">1</span> | readability $<span style="color: #24292e;">1</span> &gt; ${<span style="color: #24292e;">path</span>}readmodetempfile.html
w3m ${<span style="color: #24292e;">path</span>}readmodetempfile.html
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3d49c61" class="outline-3">
<h3 id="org3d49c61"><span class="section-number-3">4.2.</span> License</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Mozilla readability has an Apache 2.0 license, found <a href="Licenses/APACHE.md">here</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org512266c" class="outline-2">
<h2 id="org512266c"><span class="section-number-2">5.</span> Dependencies</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org7d8caab" class="outline-4">
<h4 id="org7d8caab"><span class="section-number-4">5.0.1.</span> fzf</h4>
<div class="outline-text-4" id="text-5-0-1">
<p target="_blank.">
Fuzzy finder for command line lists, found <a href="https://github.com/junegunn/fzf" target="_blank.">here</a>.
</p>
</div>
</div>
<div id="outline-container-org619db47" class="outline-4">
<h4 id="org619db47"><span class="section-number-4">5.0.2.</span> MPV</h4>
<div class="outline-text-4" id="text-5-0-2">
<p target="_blank">
A lightweight, command-line video player available <a href="https://github.com/mpv-player/mpv" target="_blank">here</a>.
</p>
</div>
</div>
<div id="outline-container-orgb011d25" class="outline-4">
<h4 id="orgb011d25"><span class="section-number-4">5.0.3.</span> yt-dlp</h4>
<div class="outline-text-4" id="text-5-0-3">
<p target="_blank">
Command-line interface for interacting with YouTube and other video/audio hosted on https, available <a href="https://github.com/yt-dlp/yt-dlp" target="_blank">here</a>.
</p>
</div>
</div>
<div id="outline-container-orgaafe3d5" class="outline-4">
<h4 id="orgaafe3d5"><span class="section-number-4">5.0.4.</span> readability</h4>
<div class="outline-text-4" id="text-5-0-4">
<p target="_blank">
Mozilla readability for isolating body of HTML pages, installed from <a href="https://www.npmjs.com/package/readability-cli/v/2.4.0" target="_blank">here</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd8e174e" class="outline-2">
<h2 id="orgd8e174e"><span class="section-number-2">6.</span> Generate config file</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-text">alias metube='sh $HOME/.clisuite/src/metube.sh'  
alias readmode='sh $HOME/.clisuite/src/readmode.sh'  
alias speckify='sh $HOME/.clisuite/src/speckify.sh'  
</pre>
</div>
</div>
</div>
